WRK/w4/W4D3/skeleton/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 1]]
---
  </tr>
  <% @cat.rental_requests.includes(:requester).order("start_date").each do |req| %>