WRK/w4/w4d2_2/w4d2/Cat99/app/controllers/cat_rental_requests_controller.rb

  def index
    @requests = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"