HW/w4/w4d4/skeleton/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2016-09-07 19:22:47.875839"], ["end_date", "2016-09-21"], ["start_date", "2016-09-20"], ["status", "PENDING"], ["updated_at", "2016-09-07 19:22:47.875839"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save