HW/w4/w4d4/skeleton/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = 2  [["description", "fsfdfdfsf"], ["updated_at", "2016-09-07 20:24:48.759831"]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)