HW/w4/w4d4/skeleton/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.email = "test@email.com"
    if @user.save