WRK/w4/w4d2/Cat99/app/controllers/cats_controller.rb

  def show
    @cats = [Cat.find(params[:id])]
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @cat = Cat.new(cat_params)
    @cat.age = get_age
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    @cat.age = get_age
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2016-08-05"], ["color", "Orange"], ["name", "Joe"], ["sex", "F"], ["description", "fdsfa"], ["updated_at", "2016-09-06 19:44:11.142957"], ["id", 18]]